ADMIN_START_TEXT = ("В этом боте вы можете проверить расписание сотрудников и фактическое время начала и конца работы. Также вы можете посмотреть фото "
                    "подготовленного сотрудником рабочего места.")

MASTER_START_TEXT = ('Перед началом рабочего дня пожалуйста нажмите кнопку "Приступил к работе", а затем отправьте в '
                     'бот фото рабочего места.\n По окончании работы нажмите кнопку "Закончил работу" и отправьте '
                     'сюда фото рабочего места\n Хорошего дня!')

MASTER_START_WORK_TEXT = "Здравствуйте. Вы начинаете рабочий день. Пожалуйста, отправьте фото рабочего места сюда."

MASTER_END_WORK_TEXT = "Вы заканчиваете рабочий день. Пожалуйста, отправьте фото рабочего места сюда."

MASTER_START_WORK_IMAGE_RECEIVED_TEXT = "Фото с рабочего места получено. Хорошего рабочего дня."

MASTER_END_WORK_IMAGE_RECEIVED_TEXT = "Фото с рабочего места получено. Хорошего отдыха, до свидания."

NO_MASTER_FOUND = "К сожалению, ваших данных нет в базе. Обратитесь к своему руководителю."